stm32duino/Arduino_Core_STM32/system/Drivers/STM32U3xx_HAL_Driver/Inc/stm32u3xx_ll_dma.h
/** @defgroup DMA_LL_EC_DEST_ADDR_UPDATE_MODE Burst Destination Address Update Mode
  * @{
  */
#define LL_DMA_BURST_DEST_ADDR_INCREMENT 0x00000000U   /*!< Destination address pointer is incremented after each
                                                            burst transfer by destination update value                */
#define LL_DMA_BURST_DEST_ADDR_DECREMENT DMA_CBR1_DDEC /*!< Destination address pointer is decremented after each
                                                            burst transfer by destination update value                */
/**
  * @}
  */

#if defined (CPU_IN_SECURE_STATE)
/** @defgroup DMA_LL_EC_SOURCE_SECURITY_ATTRIBUTE Source Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_NSEC 0x00000000U /*!< NSecure channel */
#define LL_DMA_CHANNEL_SEC  0x00000001U /*!< Secure channel  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_SOURCE_SECURITY_ATTRIBUTE Source Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_SRC_NSEC 0x00000000U   /*!< NSecure transfer from the source */
#define LL_DMA_CHANNEL_SRC_SEC  DMA_CTR1_SSEC /*!< Secure transfer from the source  */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_DESTINATION_SECURITY_ATTRIBUTE Destination Security Attribute
  * @{
  */
#define LL_DMA_CHANNEL_DEST_NSEC 0x00000000U   /*!< NSecure transfer from the destination */
#define LL_DMA_CHANNEL_DEST_SEC  DMA_CTR1_DSEC /*!< Secure transfer from the destination  */
/**
  * @}
  */
#endif /* CPU_IN_SECURE_STATE */

/** @defgroup DMA_LL_EC_LINKEDLIST_NODE_TYPE Linked list node type
  * @{
  */
#define LL_DMA_GPDMA_LINEAR_NODE 0x01U /*!< GPDMA node : linear addressing node      */
#define LL_DMA_GPDMA_2D_NODE     0x02U /*!< GPDMA node : 2 dimension addressing node */

/**
  * @}
  */

/** @defgroup DMA_LL_EC_LINKEDLIST_REGISTER_UPDATE Linked list register update
  * @{
  */
#define LL_DMA_UPDATE_CTR1 DMA_CLLR_UT1 /*!< Update CTR1 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CTR2 DMA_CLLR_UT2 /*!< Update CTR2 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CBR1 DMA_CLLR_UB1 /*!< Update CBR1 register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CSAR DMA_CLLR_USA /*!< Update CSAR register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CDAR DMA_CLLR_UDA /*!< Update CDAR register from memory :
                                             available for all DMA channels                */
#define LL_DMA_UPDATE_CTR3 DMA_CLLR_UT3 /*!< Update CTR3 register from memory :
                                             available only for 2D addressing DMA channels */
#define LL_DMA_UPDATE_CBR2 DMA_CLLR_UB2 /*!< Update CBR2 register from memory :
                                             available only for 2D addressing DMA channels */
#define LL_DMA_UPDATE_CLLR DMA_CLLR_ULL /*!< Update CLLR register from memory :
                                             available for all DMA channels                */
/**
  * @}
  */

/** @defgroup DMA_LL_EC_REQUEST_SELECTION Request Selection
  * @{
  */
/* GPDMA1 Hardware Requests */
#define LL_GPDMA1_REQUEST_ADC1          0U     /*!< GPDMA1 HW request is ADC1         */
#define LL_GPDMA1_REQUEST_ADC2          1U     /*!< GPDMA1 HW request is ADC2         */
#define LL_GPDMA1_REQUEST_DAC1_CH1      2U     /*!< GPDMA1 HW request is DAC1_CH1     */
#define LL_GPDMA1_REQUEST_DAC1_CH2      3U     /*!< GPDMA1 HW request is DAC1_CH2     */
#define LL_GPDMA1_REQUEST_TIM6_UP       4U     /*!< GPDMA1 HW request is TIM6_UP      */
#define LL_GPDMA1_REQUEST_TIM7_UP       5U     /*!< GPDMA1 HW request is TIM7_UP      */
#define LL_GPDMA1_REQUEST_SPI1_RX       6U     /*!< GPDMA1 HW request is SPI1_RX      */
#define LL_GPDMA1_REQUEST_SPI1_TX       7U     /*!< GPDMA1 HW request is SPI1_TX      */
#define LL_GPDMA1_REQUEST_SPI2_RX       8U     /*!< GPDMA1 HW request is SPI2_RX      */
#define LL_GPDMA1_REQUEST_SPI2_TX       9U     /*!< GPDMA1 HW request is SPI2_TX      */
#define LL_GPDMA1_REQUEST_SPI3_RX       10U    /*!< GPDMA1 HW request is SPI3_RX      */
#define LL_GPDMA1_REQUEST_SPI3_TX       11U    /*!< GPDMA1 HW request is SPI3_TX      */
#define LL_GPDMA1_REQUEST_I2C1_RX       12U    /*!< GPDMA1 HW request is I2C1_RX      */
#define LL_GPDMA1_REQUEST_I2C1_TX       13U    /*!< GPDMA1 HW request is I2C1_TX      */
#define LL_GPDMA1_REQUEST_I2C1_EVC      14U    /*!< GPDMA1 HW request is I2C1_EVC     */
#if defined (I2C2)
#define LL_GPDMA1_REQUEST_I2C2_RX       15U    /*!< GPDMA1 HW request is I2C2_RX      */
#define LL_GPDMA1_REQUEST_I2C2_TX       16U    /*!< GPDMA1 HW request is I2C2_TX      */
#define LL_GPDMA1_REQUEST_I2C2_EVC      17U    /*!< GPDMA1 HW request is I2C2_EVC     */
#endif /* I2C2 */
#define LL_GPDMA1_REQUEST_I2C3_RX       18U    /*!< GPDMA1 HW request is I2C3_RX      */
#define LL_GPDMA1_REQUEST_I2C3_TX       19U    /*!< GPDMA1 HW request is I2C3_TX      */
#define LL_GPDMA1_REQUEST_I2C3_EVC      20U    /*!< GPDMA1 HW request is I2C3_EVC     */
#if defined (I2C4)
#define LL_GPDMA1_REQUEST_I2C4_RX       21U    /*!< GPDMA1 HW request is I2C4_RX      */
#define LL_GPDMA1_REQUEST_I2C4_TX       22U    /*!< GPDMA1 HW request is I2C4_TX      */
#define LL_GPDMA1_REQUEST_I2C4_EVC      23U    /*!< GPDMA1 HW request is I2C4_EVC     */
#endif /* I2C4 */
#define LL_GPDMA1_REQUEST_USART1_RX     24U    /*!< GPDMA1 HW request is USART1_RX    */
#define LL_GPDMA1_REQUEST_USART1_TX     25U    /*!< GPDMA1 HW request is USART1_TX    */
#if defined (USART2)
#define LL_GPDMA1_REQUEST_USART2_RX     26U    /*!< GPDMA1 HW request is USART2_RX    */
#define LL_GPDMA1_REQUEST_USART2_TX     27U    /*!< GPDMA1 HW request is USART2_TX    */
#endif /* USART2 */
#define LL_GPDMA1_REQUEST_USART3_RX     28U    /*!< GPDMA1 HW request is USART3_RX    */
#define LL_GPDMA1_REQUEST_USART3_TX     29U    /*!< GPDMA1 HW request is USART3_TX    */
#define LL_GPDMA1_REQUEST_UART4_RX      30U    /*!< GPDMA1 HW request is UART4_RX     */
#define LL_GPDMA1_REQUEST_UART4_TX      31U    /*!< GPDMA1 HW request is UART4_TX     */
#define LL_GPDMA1_REQUEST_UART5_RX      32U    /*!< GPDMA1 HW request is UART5_RX     */
#define LL_GPDMA1_REQUEST_UART5_TX      33U    /*!< GPDMA1 HW request is UART5_TX     */
#define LL_GPDMA1_REQUEST_LPUART1_RX    34U    /*!< GPDMA1 HW request is LPUART1_RX   */
#define LL_GPDMA1_REQUEST_LPUART1_TX    35U    /*!< GPDMA1 HW request is LPUART1_TX   */
#if defined (SAI1)
#define LL_GPDMA1_REQUEST_SAI1_A        36U    /*!< GPDMA1 HW request is SAI1_A       */
#define LL_GPDMA1_REQUEST_SAI1_B        37U    /*!< GPDMA1 HW request is SAI1_B       */
#endif /* SAI1 */
/*  Reserved                            38U                                           */
/*  Reserved                            39U                                           */
#define LL_GPDMA1_REQUEST_OCTOSPI1      40U    /*!< GPDMA1 HW request is OCTOSPI1     */
/*  Reserved                            41U                                           */
#define LL_GPDMA1_REQUEST_TIM1_CH1      42U    /*!< GPDMA1 HW request is TIM1_CH1     */
#define LL_GPDMA1_REQUEST_TIM1_CH2      43U    /*!< GPDMA1 HW request is TIM1_CH2     */
#define LL_GPDMA1_REQUEST_TIM1_CH3      44U    /*!< GPDMA1 HW request is TIM1_CH3     */
#define LL_GPDMA1_REQUEST_TIM1_CH4      45U    /*!< GPDMA1 HW request is TIM1_CH4     */
#define LL_GPDMA1_REQUEST_TIM1_UP       46U    /*!< GPDMA1 HW request is TIM1_UP      */
#define LL_GPDMA1_REQUEST_TIM1_TRIG     47U    /*!< GPDMA1 HW request is TIM1_TRIG    */
#define LL_GPDMA1_REQUEST_TIM1_COM      48U    /*!< GPDMA1 HW request is TIM1_COM     */
#define LL_GPDMA1_REQUEST_I3C1_RX       49U    /*!< GPDMA1 HW request is I3C1_RX      */
#define LL_GPDMA1_REQUEST_I3C1_TX       50U    /*!< GPDMA1 HW request is I3C1_TX      */
#define LL_GPDMA1_REQUEST_I3C1_TC       51U    /*!< GPDMA1 HW request is I3C1_TC      */
#define LL_GPDMA1_REQUEST_I3C1_RS       52U    /*!< GPDMA1 HW request is I3C1_RS      */
/*  Reserved                            53U                                           */
/*  Reserved                            54U                                           */
/*  Reserved                            55U                                           */
#define LL_GPDMA1_REQUEST_TIM2_CH1      56U    /*!< GPDMA1 HW request is TIM2_CH1     */
#define LL_GPDMA1_REQUEST_TIM2_CH2      57U    /*!< GPDMA1 HW request is TIM2_CH2     */
#define LL_GPDMA1_REQUEST_TIM2_CH3      58U    /*!< GPDMA1 HW request is TIM2_CH3     */
#define LL_GPDMA1_REQUEST_TIM2_CH4      59U    /*!< GPDMA1 HW request is TIM2_CH4     */
#define LL_GPDMA1_REQUEST_TIM2_UP       60U    /*!< GPDMA1 HW request is TIM2_UP      */
#define LL_GPDMA1_REQUEST_TIM3_CH1      61U    /*!< GPDMA1 HW request is TIM3_CH1     */
#define LL_GPDMA1_REQUEST_TIM3_CH2      62U    /*!< GPDMA1 HW request is TIM3_CH2     */
#define LL_GPDMA1_REQUEST_TIM3_CH3      63U    /*!< GPDMA1 HW request is TIM3_CH3     */
#define LL_GPDMA1_REQUEST_TIM3_CH4      64U    /*!< GPDMA1 HW request is TIM3_CH4     */
#define LL_GPDMA1_REQUEST_TIM3_UP       65U    /*!< GPDMA1 HW request is TIM3_UP      */
#define LL_GPDMA1_REQUEST_TIM3_TRIG     66U    /*!< GPDMA1 HW request is TIM3_TRIG    */
#define LL_GPDMA1_REQUEST_TIM4_CH1      67U    /*!< GPDMA1 HW request is TIM4_CH1     */
#define LL_GPDMA1_REQUEST_TIM4_CH2      68U    /*!< GPDMA1 HW request is TIM4_CH2     */
#define LL_GPDMA1_REQUEST_TIM4_CH3      69U    /*!< GPDMA1 HW request is TIM4_CH3     */
#define LL_GPDMA1_REQUEST_TIM4_CH4      70U    /*!< GPDMA1 HW request is TIM4_CH4     */
#define LL_GPDMA1_REQUEST_TIM4_UP       71U    /*!< GPDMA1 HW request is TIM4_UP      */
#if defined (I3C2)
#define LL_GPDMA1_REQUEST_I3C2_RX       72U    /*!< GPDMA1 HW request is I3C2_RX      */
#define LL_GPDMA1_REQUEST_I3C2_TX       73U    /*!< GPDMA1 HW request is I3C2_TX      */
#define LL_GPDMA1_REQUEST_I3C2_TC       74U    /*!< GPDMA1 HW request is I3C2_TC      */
#define LL_GPDMA1_REQUEST_I3C2_RS       75U    /*!< GPDMA1 HW request is I3C2_RS      */
#endif /* I3C2 */
#if defined (SPI4)
#define LL_GPDMA1_REQUEST_SPI4_RX       76U    /*!< GPDMA1 HW request is SPI4_RX      */
#define LL_GPDMA1_REQUEST_SPI4_TX       77U    /*!< GPDMA1 HW request is SPI4_TX      */
#endif /* SPI4 */
#define LL_GPDMA1_REQUEST_TIM15_CH1     78U    /*!< GPDMA1 HW request is TIM15_CH1    */
#define LL_GPDMA1_REQUEST_TIM15_UP      79U    /*!< GPDMA1 HW request is TIM15_UP     */
#define LL_GPDMA1_REQUEST_TIM15_TRIG    80U    /*!< GPDMA1 HW request is TIM15_TRIG   */
#define LL_GPDMA1_REQUEST_TIM15_COM     81U    /*!< GPDMA1 HW request is TIM15_COM    */
#define LL_GPDMA1_REQUEST_TIM16_CH1     82U    /*!< GPDMA1 HW request is TIM16_CH1    */
#define LL_GPDMA1_REQUEST_TIM16_UP      83U    /*!< GPDMA1 HW request is TIM16_UP     */
#define LL_GPDMA1_REQUEST_TIM17_CH1     84U    /*!< GPDMA1 HW request is TIM17_CH1    */
#define LL_GPDMA1_REQUEST_TIM17_UP      85U    /*!< GPDMA1 HW request is TIM17_UP     */
/*  Reserved                            86U                                           */
#define LL_GPDMA1_REQUEST_AES_IN        87U    /*!< GPDMA1 HW request is AES_IN       */
#define LL_GPDMA1_REQUEST_AES_OUT       88U    /*!< GPDMA1 HW request is AES_OUT      */
#define LL_GPDMA1_REQUEST_HASH_IN       89U    /*!< GPDMA1 HW request is HASH_IN      */
/*  Reserved                            90U                                           */
#if defined (TIM8)
#define LL_GPDMA1_REQUEST_TIM8_CH1      91U    /*!< GPDMA1 HW request is TIM8_CH1     */
#define LL_GPDMA1_REQUEST_TIM8_CH2      92U    /*!< GPDMA1 HW request is TIM8_CH2     */
#define LL_GPDMA1_REQUEST_TIM8_CH3      93U    /*!< GPDMA1 HW request is TIM8_CH3     */
#define LL_GPDMA1_REQUEST_TIM8_CH4      94U    /*!< GPDMA1 HW request is TIM8_CH4     */
#define LL_GPDMA1_REQUEST_TIM8_UP       95U    /*!< GPDMA1 HW request is TIM8_UP      */
#define LL_GPDMA1_REQUEST_TIM8_TRIG     96U    /*!< GPDMA1 HW request is TIM8_TRIG    */
#define LL_GPDMA1_REQUEST_TIM8_COM      97U    /*!< GPDMA1 HW request is TIM8_COM     */
#endif /* TIM8 */
#if defined (ADF1)
#define LL_GPDMA1_REQUEST_ADF1_FLT0     98U    /*!< GPDMA1 HW request is ADF1_FLT0    */
#endif /* ADF1 */
/*  Reserved                            99U                                           */
/*  Reserved                            100U                                          */
/*  Reserved                            101U                                          */
/*  Reserved                            102U                                          */
#define LL_GPDMA1_REQUEST_SAES_IN       103U   /*!< GPDMA1 HW request is SAES_IN      */
#define LL_GPDMA1_REQUEST_SAES_OUT      104U   /*!< GPDMA1 HW request is SAES_OUT     */
#define LL_GPDMA1_REQUEST_LPTIM1_IC1    105U   /*!< GPDMA1 HW request is LPTIM1_IC1   */
#define LL_GPDMA1_REQUEST_LPTIM1_IC2    106U   /*!< GPDMA1 HW request is LPTIM1_IC2   */
#define LL_GPDMA1_REQUEST_LPTIM1_UE     107U   /*!< GPDMA1 HW request is LPTIM1_UE    */
#define LL_GPDMA1_REQUEST_LPTIM2_IC1    108U   /*!< GPDMA1 HW request is LPTIM2_IC1   */
#define LL_GPDMA1_REQUEST_LPTIM2_IC2    109U   /*!< GPDMA1 HW request is LPTIM2_IC2   */
#define LL_GPDMA1_REQUEST_LPTIM2_UE     110U   /*!< GPDMA1 HW request is LPTIM2_UE    */
#define LL_GPDMA1_REQUEST_LPTIM3_IC1    111U   /*!< GPDMA1 HW request is LPTIM3_IC1   */
#define LL_GPDMA1_REQUEST_LPTIM3_IC2    112U   /*!< GPDMA1 HW request is LPTIM3_IC2   */
#define LL_GPDMA1_REQUEST_LPTIM3_UE     113U   /*!< GPDMA1 HW request is LPTIM3_UE    */
/**
  * @}
  */

